# FaceArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceArrayIterator Class
Members See Also
---
An iterator to a face array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class FaceArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class FaceArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class FaceArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FaceArrayIterator
# See Also
FaceArrayIterator Members
Autodesk.Revit.DB Namespace